[
  {
    "title": "Self-Taught Programmer",
    "content": "Although the inspiration to learn coding came a bit late, but the desire and passion was strong enough for convincing me to take up the self-learning path and gradually evolve as a good programmer with time. The rationale behind such inspiration is that no matter in which direction I look, technology is being used everywhere, in every sector, in every industry and almost all of our day to day comforts are utilizing the power of computers in someway or the other. I think it's the best time to grab onto the momentum of the 21st century when technological advancement is reaching every nook and corner of the world."
  },
  {
    "title": "Hunger for Learning",
    "content": "The continuous urge to learn something new and put it into application is what keeps me going on and it is definitely the reason I finally found the path of programming. The immense amount and variety of technologies that are available out there to learn motivates me everyday to dedicate some good amount of time to brush up on the existing skills or add new skills to my arsenal. This helps me to keep myself updated with the pace at which the world is moving forward embracing new ideas and knowledge."
  },
  {
    "title": "Interests in API",
    "content": "It might seem like API means Application Programming Interface but it's not. In fact, it's my interest in Aviation, Programming and Investing. A giant machine being able to carry tonnes of payload and moving at close to thousand miles per hour is something to be fascinated about. The way automation is being used in aviation is something to be noted. When it comes to Programming part, it is quite obvious because this whole website is just for showing my interest in programming. Lastly, Investing is a very wide and interesting subject to learn and master because if something that comes second after knowledge is Finance or Money and the way it drives the world is amazing. The use cases of programming in Finance also adds on to the inquisitive list."
  },
  {
    "title": "Major source of Inspiration",
    "content": "This list can just go on and on because if we are a keen observer we would find that there a lot of things and people that inspire us everyday. But to be very specific, for me, Former Indian Captain and \"The Wall\" Rahul Dravid is a major source of inspiration not just because of his cricket statistics but for his overall persona and the respect he has earned from people around. He proved that he wasn't a gifted cricketer like the Master Blaster but with his dedication, he proved himself to be a legend in the world of cricket and even after that he continues to contribute to Indian cricket in a big way. He inspires me to think that \"I might not be a gifted programmer or coding nerd like some people are but with my dedication and passion, I will be able to prove myself as a very good programmer\". His retirement quote is even more inspirational - \"I've failed at times but I never stopped trying\"."
  }
]
